jcfield-boop/Lango/sdkconfig.defaults.esp32s3
# Langoustine - ESP32-S3-WROOM-1-N32R16V Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash 32MB + QIO
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PSRAM 16MB OPI (Octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SIZE=16777216
# Buffers <= 4KB stay in SRAM; larger allocations prefer PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_MEMTEST=n

# MbedTLS: use PSRAM for TLS buffers + smaller output buffer
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# WebSocket support (required for browser voice UI)
CONFIG_HTTPD_WS_SUPPORT=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_s3_32mb.csv"

# Watchdog: 60s to cover slow LLM + TTS API calls + parallel tool HTTPS requests.
# Previously 30s — tool wait timeout was 60s, causing WDT to fire before agent could recover.
# Tool wait timeout is now 25s, so WDT at 60s gives a clean safety net.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

# LittleFS: longer filename support
CONFIG_LITTLEFS_OBJ_NAME_LEN=64

# SNTP: also accept NTP server from DHCP option 42 (belt-and-suspenders alongside hardcoded servers)
CONFIG_LWIP_DHCP_GET_NTP_SRV=y

# Socket file descriptors: default MAX_SOCKETS=16 uses FDs 48–63 (FD_SETSIZE=64).
# With HTTPS+HTTP servers + WSS + Telegram + TLS API sessions all open concurrently,
# the 64th FD is hit and accept() fails with ENFILE. Bump to 24 to give headroom.
CONFIG_LWIP_MAX_SOCKETS=24

# WiFi TX power: 20dBm default causes 300mA current surge → hardware brownout on marginal USB supplies.
# 10dBm (40*0.25): sustained HTTPS TX at 13dBm still triggers hardware BOD during LLM API calls.
# 10dBm is typically the minimum allowed by ESP-IDF kconfig range. Increase once PSU is stable.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=10

# WiFi memory optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# Console: UART primary only (GPIO43/44)
# USB Serial/JTAG secondary disabled — GPIO19/20 are dedicated to USB OTG host (webcam)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB OTG host configuration for UVC webcam
# Larger control transfer buffer to fit UVC descriptor sets (> default 256 bytes)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048
# Bias isochronous buffers toward IN (camera → ESP) for better MJPEG throughput
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y

# Brownout detector: default level 7 (~3.5V) fires on WiFi startup current surge on USB power.
# Disable for USB-powered bring-up; re-enable (or set level 0) for production on clean PSU.
CONFIG_ESP_BROWNOUT_DET=n

# ESP-SR WakeNet9 model selection: "Hi ESP" wake word
CONFIG_SR_WN_WN9_HIESP=y

# Debug build — disable for production
# NOTE: CONFIG_COMPILER_OPTIMIZATION_NONE=y (-O0) causes sys_evt stack overflow
# at default 2304-byte stack; keep default -Os optimization instead.
# Heap corruption detection: catches double-free at ~10% overhead; clears on fix
CONFIG_HEAP_CORRUPTION_DETECTION_BASIC=y
# Stack overflow: canary value written at bottom of each task stack; checked on context switch.
# Catches overflow before it silently corrupts adjacent heap memory.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# Allow FreeRTOS task stacks to be allocated from PSRAM (S3 has 16MB — use it)
# NOTE: tool_par tasks MUST use SRAM stacks (xTaskCreate default) — any task that
# calls LittleFS/NVS cannot use a PSRAM stack (cache-disable assertion in esp_flash).
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Verbose logging — all ESP_LOGD() visible
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
